In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r"C:\Users\Veman S Chippa\OneDrive\Desktop\Culinary Compass\Case Study - Veman Chippa - Dump.csv")

In [3]:
df.head()

,Month,WEEK,DT,RESTAURANT_ID,REST_NAME,CITY,AREA,TOTAL_ORDERS,GMV,MENU_SESSIONS
0,01/06/2025,22,2025-06-01,70556,Brand D,Mumbai,Bandra West,1,1255.380029,13
1,01/06/2025,22,2025-06-01,76509,Brand D,Mumbai,Malad Kan West,1,250.950000,15
2,01/06/2025,22,2025-06-01,76512,Brand D,Mumbai,Marol Sakinaka,1,414.950000,22
3,01/06/2025,22,2025-06-01,83864,Brand D,Mumbai,Borivali,3,1834.779999,31
4,01/06/2025,22,2025-06-01,184604,Brand G,Mumbai,Malad Kan East,42,15521.302120,331

In [4]:
df.tail()

,Month,WEEK,DT,RESTAURANT_ID,REST_NAME,CITY,AREA,TOTAL_ORDERS,GMV,MENU_SESSIONS
1256,01/08/2025,35,2025-08-31,880733,Brand C,Mumbai,Vashi,4,1898.620028,46
1257,01/08/2025,35,2025-08-31,974354,Brand B,Mumbai,Mulund,26,8279.178019,143
1258,01/08/2025,35,2025-08-31,974356,Brand B,Mumbai,Powai,34,13114.183190,143
1259,01/08/2025,35,2025-08-31,1037606,Brand A,Mumbai,Andheri East,79,32877.026520,393
1260,01/08/2025,35,2025-08-31,1074224,Brand D,Mumbai,Matunga Wadala,5,2362.249953,22

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1261 entries, 0 to 1260
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Month          1261 non-null   object
 1   WEEK           1261 non-null   int64
 2   DT             1261 non-null   object
 3   RESTAURANT_ID  1261 non-null   int64
 4   REST_NAME      1261 non-null   object
 5   CITY           1261 non-null   object
 6   AREA           1261 non-null   object
 7   TOTAL_ORDERS   1261 non-null   int64
 8   GMV            1257 non-null   float64
 9   MENU_SESSIONS  1261 non-null   int64
dtypes: float64(1), int64(4), object(5)
memory usage: 98.6+ KB

In [6]:
df.describe(include='all')

,Month,WEEK,DT,RESTAURANT_ID,REST_NAME,CITY,AREA,TOTAL_ORDERS,GMV,MENU_SESSIONS
count,1261,1261.000000,1261,1.261000e+03,1261,1261,1261,1261.000000,1257.000000,1261.000000
unique,3,NaN,92,NaN,7,1,15,NaN,NaN,NaN
top,01/08/2025,NaN,2025-06-13,NaN,Brand D,Mumbai,Marol Sakinaka,NaN,NaN,NaN
freq,439,NaN,17,NaN,621,1261,159,NaN,NaN,NaN
mean,NaN,28.954005,NaN,5.613745e+05,NaN,NaN,NaN,16.094370,7038.880093,98.432197
std,NaN,3.821341,NaN,3.956870e+05,NaN,NaN,NaN,21.709112,8556.927562,108.555967
min,NaN,22.000000,NaN,4.724700e+04,NaN,NaN,NaN,1.000000,215.469997,1.000000
25%,NaN,26.000000,NaN,7.651200e+04,NaN,NaN,NaN,2.000000,905.100012,16.000000
50%,NaN,29.000000,NaN,6.689830e+05,NaN,NaN,NaN,4.000000,2736.605962,42.000000
75%,NaN,32.000000,NaN,9.743540e+05,NaN,NaN,NaN,26.000000,10432.250990,165.000000
max,NaN,35.000000,NaN,1.074224e+06,NaN,NaN,NaN,109.000000,46523.410490,620.000000

In [7]:
df.dtypes

Month             object
WEEK               int64
DT                object
RESTAURANT_ID      int64
REST_NAME         object
CITY              object
AREA              object
TOTAL_ORDERS       int64
GMV              float64
MENU_SESSIONS      int64
dtype: object

In [8]:
df['Month'].unique()[:10]

array(['01/06/2025', '01/07/2025', '01/08/2025'], dtype=object)

In [9]:
df['DT'].unique()[:10]

array(['2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04',
       '2025-06-05', '2025-06-06', '2025-06-07', '2025-06-08',
       '2025-06-09', '2025-06-10'], dtype=object)

In [10]:
df['Month'] = df['Month'].str.strip()
df['DT'] = df['DT'].str.strip()

In [11]:
df['Month'] = pd.to_datetime(df['Month'], format='%d/%m/%Y', errors='coerce')
df['DT'] = pd.to_datetime(df['DT'], format='%Y-%m-%d', errors='coerce')

In [12]:
df[['Month','DT']].head(10)

       Month         DT
0 2025-06-01 2025-06-01
1 2025-06-01 2025-06-01
2 2025-06-01 2025-06-01
3 2025-06-01 2025-06-01
4 2025-06-01 2025-06-01
5 2025-06-01 2025-06-01
6 2025-06-01 2025-06-01
7 2025-06-01 2025-06-01
8 2025-06-01 2025-06-01
9 2025-06-01 2025-06-01

In [13]:
df[['Month','DT']].isna().sum()

Month    0
DT       0
dtype: int64

In [14]:
df.isnull().sum()

Month            0
WEEK             0
DT               0
RESTAURANT_ID    0
REST_NAME        0
CITY             0
AREA             0
TOTAL_ORDERS     0
GMV              4
MENU_SESSIONS    0
dtype: int64

In [15]:
# 2. Inspect GMV null rows
df[df['GMV'].isna()]

,Month,WEEK,DT,RESTAURANT_ID,REST_NAME,CITY,AREA,TOTAL_ORDERS,GMV,MENU_SESSIONS
553,2025-07-01,29,2025-07-14,880733,Brand C,Mumbai,Vashi,1,NaN,11
650,2025-07-01,30,2025-07-23,76509,Brand D,Mumbai,Malad Kan West,1,NaN,12
762,2025-08-01,31,2025-08-01,76508,Brand D,Mumbai,Lower Parel Worli,1,NaN,12
919,2025-08-01,33,2025-08-12,1053297,Brand D,Mumbai,Powai,1,NaN,1

In [16]:
df['order_value_temp'] = df['GMV'] / df['TOTAL_ORDERS'].replace(0, np.nan)
median_order_value = df['order_value_temp'].median(skipna=True)
median_order_value

442.1614237142857

In [17]:
df.loc[df['GMV'].isna(), 'GMV'] = df.loc[df['GMV'].isna(), 'TOTAL_ORDERS'] * median_order_value

# Clean temp column
df.drop(columns=['order_value_temp'], inplace=True)

In [18]:
df['GMV'].isna().sum()
df.loc[[553,650,762,919], ['TOTAL_ORDERS','GMV']]

     TOTAL_ORDERS         GMV
553             1  442.161424
650             1  442.161424
762             1  442.161424
919             1  442.161424

In [19]:
df['conversion_rate'] = df['TOTAL_ORDERS'] / df['MENU_SESSIONS']

In [20]:
df[['TOTAL_ORDERS','MENU_SESSIONS','conversion_rate']].head()

   TOTAL_ORDERS  MENU_SESSIONS  conversion_rate
0             1             13         0.076923
1             1             15         0.066667
2             1             22         0.045455
3             3             31         0.096774
4            42            331         0.126888

In [21]:
df['month_year'] = df['Month'].dt.to_period('M')

In [22]:
df[['Month','month_year']].head()

       Month month_year
0 2025-06-01    2025-06
1 2025-06-01    2025-06
2 2025-06-01    2025-06
3 2025-06-01    2025-06
4 2025-06-01    2025-06

In [23]:
df['day_of_week'] = df['DT'].dt.day_name()
df['is_weekend'] = df['day_of_week'].isin(['Saturday','Sunday']).astype(int)

In [24]:
df[['DT','day_of_week','is_weekend']].tail()

             DT day_of_week  is_weekend
1256 2025-08-31      Sunday           1
1257 2025-08-31      Sunday           1
1258 2025-08-31      Sunday           1
1259 2025-08-31      Sunday           1
1260 2025-08-31      Sunday           1

In [25]:
df['week_from_date'] = df['DT'].dt.isocalendar().week
df[['WEEK','week_from_date']].head(50)

    WEEK  week_from_date
0     22              22
1     22              22
2     22              22
3     22              22
4     22              22
5     22              22
6     22              22
7     22              22
8     22              22
9     22              22
10    22              22
11    22              22
12    22              22
13    23              23
14    23              23
15    23              23
16    23              23
17    23              23
18    23              23
19    23              23
20    23              23
21    23              23
22    23              23
23    23              23
24    23              23
25    23              23
26    23              23
27    23              23
28    23              23
29    23              23
30    23              23
31    23              23
32    23              23
33    23              23
34    23              23
35    23              23
36    23              23
37    23              23
38    23              23
39    23              23
40    23              23
41    23              23
42    23              23
43    23              23
44    23              23
45    23              23
46    23              23
47    23              23
48    23              23
49    23              23

In [26]:
print("DT dtype:", df['DT'].dtype)
print("DT min:", df['DT'].min())
print("DT max:", df['DT'].max())
print("DT unique count:", df['DT'].nunique())

DT dtype: datetime64[ns]
DT min: 2025-06-01 00:00:00
DT max: 2025-08-31 00:00:00
DT unique count: 92

In [27]:
df['DT'].value_counts().head(10)

DT
2025-06-13    17
2025-06-28    16
2025-06-14    16
2025-06-20    16
2025-08-01    16
2025-08-07    16
2025-08-13    16
2025-08-08    16
2025-08-25    16
2025-07-23    16
Name: count, dtype: int64

In [28]:
print("day_of_week unique:", df['day_of_week'].nunique())
print(df['day_of_week'].value_counts())

print("week_from_date unique:", df['week_from_date'].nunique())
print(df['week_from_date'].value_counts().head(10))

day_of_week unique: 7
day_of_week
Sunday       192
Saturday     190
Friday       189
Wednesday    179
Thursday     177
Monday       171
Tuesday      163
Name: count, dtype: int64
week_from_date unique: 14
week_from_date
33    100
35    100
24     99
32     99
26     98
25     98
34     96
31     96
27     95
28     94
Name: count, dtype: Int64

In [29]:
df[['DT','day_of_week','is_weekend','WEEK','week_from_date']].head(50)

           DT day_of_week  is_weekend  WEEK  week_from_date
0  2025-06-01      Sunday           1    22              22
1  2025-06-01      Sunday           1    22              22
2  2025-06-01      Sunday           1    22              22
3  2025-06-01      Sunday           1    22              22
4  2025-06-01      Sunday           1    22              22
5  2025-06-01      Sunday           1    22              22
6  2025-06-01      Sunday           1    22              22
7  2025-06-01      Sunday           1    22              22
8  2025-06-01      Sunday           1    22              22
9  2025-06-01      Sunday           1    22              22
10 2025-06-01      Sunday           1    22              22
11 2025-06-01      Sunday           1    22              22
12 2025-06-01      Sunday           1    22              22
13 2025-06-02      Monday           0    23              23
14 2025-06-02      Monday           0    23              23
15 2025-06-02      Monday           0    23              23
16 2025-06-02      Monday           0    23              23
17 2025-06-02      Monday           0    23              23
18 2025-06-02      Monday           0    23              23
19 2025-06-02      Monday           0    23              23
20 2025-06-02      Monday           0    23              23
21 2025-06-02      Monday           0    23              23
22 2025-06-02      Monday           0    23              23
23 2025-06-02      Monday           0    23              23
24 2025-06-02      Monday           0    23              23
25 2025-06-03     Tuesday           0    23              23
26 2025-06-03     Tuesday           0    23              23
27 2025-06-03     Tuesday           0    23              23
28 2025-06-03     Tuesday           0    23              23
29 2025-06-03     Tuesday           0    23              23
30 2025-06-03     Tuesday           0    23              23
31 2025-06-03     Tuesday           0    23              23
32 2025-06-03     Tuesday           0    23              23
33 2025-06-03     Tuesday           0    23              23
34 2025-06-03     Tuesday           0    23              23
35 2025-06-03     Tuesday           0    23              23
36 2025-06-04   Wednesday           0    23              23
37 2025-06-04   Wednesday           0    23              23
38 2025-06-04   Wednesday           0    23              23
39 2025-06-04   Wednesday           0    23              23
40 2025-06-04   Wednesday           0    23              23
41 2025-06-04   Wednesday           0    23              23
42 2025-06-04   Wednesday           0    23              23
43 2025-06-04   Wednesday           0    23              23
44 2025-06-04   Wednesday           0    23              23
45 2025-06-04   Wednesday           0    23              23
46 2025-06-04   Wednesday           0    23              23
47 2025-06-05    Thursday           0    23              23
48 2025-06-05    Thursday           0    23              23
49 2025-06-05    Thursday           0    23              23

In [30]:
df[['DT','day_of_week']].tail()

             DT day_of_week
1256 2025-08-31      Sunday
1257 2025-08-31      Sunday
1258 2025-08-31      Sunday
1259 2025-08-31      Sunday
1260 2025-08-31      Sunday

In [31]:
#Q1 Conversion rate by restaurant name
restaurant_conv = (
    df.groupby('REST_NAME')
      .agg(
          total_orders=('TOTAL_ORDERS','sum'),
          total_menu_opens=('MENU_SESSIONS','sum'),
      )
)

restaurant_conv['conversion_rate'] = restaurant_conv['total_orders'] / restaurant_conv['total_menu_opens']

restaurant_conv.sort_values('conversion_rate', ascending=False).head(10)

           total_orders  total_menu_opens  conversion_rate
REST_NAME
Brand A            6162             29124         0.211578
Brand G            4451             26009         0.171133
Brand B            5647             33272         0.169722
Brand F            1646             10646         0.154612
Brand D            1330             10717         0.124102
Brand C             693              6183         0.112082
Brand E             366              8172         0.044787

In [32]:
##Q1
restaurant_id_conv = (
    df.groupby(['RESTAURANT_ID','REST_NAME'])
      .agg(
          total_orders=('TOTAL_ORDERS','sum'),
          total_menu_opens=('MENU_SESSIONS','sum'),
      )
)

restaurant_id_conv['conversion_rate'] = restaurant_id_conv['total_orders'] / restaurant_id_conv['total_menu_opens']

restaurant_id_conv.sort_values('conversion_rate', ascending=False).head(10)

                         total_orders  total_menu_opens  conversion_rate
RESTAURANT_ID REST_NAME
1053297       Brand D              10                26         0.384615
1073491       Brand D               7                29         0.241379
1037606       Brand A            6162             29124         0.211578
1074224       Brand D              79               421         0.187648
974356        Brand B            2942             15883         0.185229
184604        Brand G            4451             26009         0.171133
828997        Brand D              66               414         0.159420
668983        Brand D              75               474         0.158228
974354        Brand B            2705             17389         0.155558
47247         Brand F            1646             10646         0.154612

In [33]:
#Q2Code for Brand-Level Top Revenue Restaurants
brand_gmv = (
    df.groupby('REST_NAME')
      .agg(total_gmv=('GMV','sum'))
      .sort_values('total_gmv', ascending=False)
)

brand_gmv.head(5)

              total_gmv
REST_NAME
Brand A    2.345466e+06
Brand B    1.958607e+06
Brand G    1.835530e+06
Brand F    1.091042e+06
Brand D    7.475162e+05

In [34]:
#Q2Code for Restaurant-ID Level Top Revenue Outlets
restaurant_id_gmv = (
    df.groupby(['RESTAURANT_ID','REST_NAME'])
      .agg(total_gmv=('GMV','sum'))
      .sort_values('total_gmv', ascending=False)
)

restaurant_id_gmv.head(5)

                            total_gmv
RESTAURANT_ID REST_NAME
1037606       Brand A    2.345466e+06
184604        Brand G    1.835530e+06
47247         Brand F    1.091042e+06
974356        Brand B    1.023468e+06
974354        Brand B    9.351390e+05

In [35]:
#Q3 Compute Conversion Rate by Area

area_conv = (
    df.groupby('AREA')
      .agg(
          total_orders=('TOTAL_ORDERS','sum'),
          total_menu_opens=('MENU_SESSIONS','sum')
      )
)

area_conv['conversion_rate'] = area_conv['total_orders'] / area_conv['total_menu_opens']

# Sort highest to lowest
area_conv.sort_values('conversion_rate', ascending=False).head(10)

                total_orders  total_menu_opens  conversion_rate
AREA
Andheri East            6162             29124         0.211578
Matunga Wadala            79               421         0.187648
Powai                   2952             15909         0.185555
Malad Kan East          4451             26009         0.171133
Thane                     66               414         0.159420
Mulund                  2712             17418         0.155701
Andheri West            1721             11120         0.154766
Malad Kan West            83               541         0.153420
Chembur                  352              2416         0.145695
CBD Belapur              109               914         0.119256

In [36]:
## Q3Bottonn 10
area_conv.sort_values('conversion_rate').head(10)

                   total_orders  total_menu_opens  conversion_rate
AREA
Marol Sakinaka              522              9856         0.052963
Borivali                    163              1723         0.094602
Lower Parel Worli            73               757         0.096433
Vashi                       693              6183         0.112082
Bandra West                 157              1318         0.119120
CBD Belapur                 109               914         0.119256
Chembur                     352              2416         0.145695
Malad Kan West               83               541         0.153420
Andheri West               1721             11120         0.154766
Mulund                     2712             17418         0.155701

In [37]:
#Q4 orders + GMV per restaurant per month:
monthly_restaurant = (
    df.groupby(['REST_NAME', 'month_year'])
      .agg(
          monthly_orders=('TOTAL_ORDERS', 'sum'),
          monthly_gmv=('GMV', 'sum')
      )
      .reset_index()
)
monthly_restaurant.head()

monthly_restaurant = (
    df.groupby(['REST_NAME', 'month_year'])
      .agg(
          monthly_orders=('TOTAL_ORDERS', 'sum'),
          monthly_gmv=('GMV', 'sum')
      )
      .reset_index()
)
monthly_restaurant.head()

  REST_NAME month_year  monthly_orders    monthly_gmv
0   Brand A    2025-06            1588  612229.176376
1   Brand A    2025-07            2161  792138.372790
2   Brand A    2025-08            2413  941098.376170
3   Brand B    2025-06            2012  659527.237498
4   Brand B    2025-07            1945  693286.784581

In [38]:
#Q4
monthly_restaurant = monthly_restaurant.sort_values(['REST_NAME', 'month_year'])

monthly_restaurant['orders_mom_growth'] = monthly_restaurant.groupby('REST_NAME')['monthly_orders'].pct_change()
monthly_restaurant['gmv_mom_growth'] = monthly_restaurant.groupby('REST_NAME')['monthly_gmv'].pct_change()

monthly_restaurant.head()

,REST_NAME,month_year,monthly_orders,monthly_gmv,orders_mom_growth,gmv_mom_growth
0,Brand A,2025-06,1588,612229.176376,NaN,NaN
1,Brand A,2025-07,2161,792138.372790,0.360831,0.293859
2,Brand A,2025-08,2413,941098.376170,0.116613,0.188048
3,Brand B,2025-06,2012,659527.237498,NaN,NaN
4,Brand B,2025-07,1945,693286.784581,-0.033300,0.051187

In [39]:
growing_restaurants = monthly_restaurant[
    (monthly_restaurant['orders_mom_growth'] > 0) |
    (monthly_restaurant['gmv_mom_growth'] > 0)
]

growing_restaurants

,REST_NAME,month_year,monthly_orders,monthly_gmv,orders_mom_growth,gmv_mom_growth
1,Brand A,2025-07,2161,792138.372790,0.360831,0.293859
2,Brand A,2025-08,2413,941098.376170,0.116613,0.188048
4,Brand B,2025-07,1945,693286.784581,-0.033300,0.051187
7,Brand C,2025-07,270,155745.740580,0.227273,0.252868
11,Brand D,2025-08,512,286783.435164,0.312821,0.304158
13,Brand E,2025-07,144,198571.871002,0.263158,0.387027
16,Brand F,2025-07,581,377170.267719,0.489744,0.480448
17,Brand F,2025-08,675,459104.336216,0.161790,0.217234
19,Brand G,2025-07,1522,607458.291289,0.262023,0.220141
20,Brand G,2025-08,1723,730213.079316,0.132063,0.202079

In [40]:
#Q5

# Base metrics per restaurant
restaurant_summary = (
    df.groupby('REST_NAME')
      .agg(
          total_orders=('TOTAL_ORDERS', 'sum'),
          total_menu_opens=('MENU_SESSIONS', 'sum'),
          total_gmv=('GMV', 'sum')
      )
      .reset_index()
)

# Add conversion
restaurant_summary['conversion_rate'] = restaurant_summary['total_orders'] / restaurant_summary['total_menu_opens']

restaurant_summary

  REST_NAME  total_orders  total_menu_opens     total_gmv  conversion_rate
0   Brand A          6162             29124  2.345466e+06         0.211578
1   Brand B          5647             33272  1.958607e+06         0.169722
2   Brand C           693              6183  3.952798e+05         0.112082
3   Brand D          1330             10717  7.475162e+05         0.124102
4   Brand E           366              8172  4.761992e+05         0.044787
5   Brand F          1646             10646  1.091042e+06         0.154612
6   Brand G          4451             26009  1.835530e+06         0.171133

In [41]:
last_month_growth = (
    monthly_restaurant
    .groupby('REST_NAME')
    .apply(
        lambda x: x.sort_values('month_year').iloc[-1][['orders_mom_growth','gmv_mom_growth']],
        include_groups=False
    )
    .reset_index()
)
last_month_growth

  REST_NAME  orders_mom_growth  gmv_mom_growth
0   Brand A           0.116613        0.188048
1   Brand B          -0.131105       -0.126201
2   Brand C          -0.248148       -0.260188
3   Brand D           0.312821        0.304158
4   Brand E          -0.250000       -0.322846
5   Brand F           0.161790        0.217234
6   Brand G           0.132063        0.202079

In [42]:
promo_df = restaurant_summary.merge(last_month_growth, on='REST_NAME', how='left')

promo_df

,REST_NAME,total_orders,total_menu_opens,total_gmv,conversion_rate,orders_mom_growth,gmv_mom_growth
0,Brand A,6162,29124,2.345466e+06,0.211578,0.116613,0.188048
1,Brand B,5647,33272,1.958607e+06,0.169722,-0.131105,-0.126201
2,Brand C,693,6183,3.952798e+05,0.112082,-0.248148,-0.260188
3,Brand D,1330,10717,7.475162e+05,0.124102,0.312821,0.304158
4,Brand E,366,8172,4.761992e+05,0.044787,-0.250000,-0.322846
5,Brand F,1646,10646,1.091042e+06,0.154612,0.161790,0.217234
6,Brand G,4451,26009,1.835530e+06,0.171133,0.132063,0.202079

In [43]:
promo_df['promo_priority'] = promo_df.apply(
    lambda row:
        'High Traffic, Low Conversion' if (row['total_menu_opens'] > promo_df['total_menu_opens'].median() 
                                           and row['conversion_rate'] < promo_df['conversion_rate'].median())
        else 'Low Traffic, High Conversion' if (row['total_menu_opens'] < promo_df['total_menu_opens'].median() 
                                               and row['conversion_rate'] > promo_df['conversion_rate'].median())
        else 'Growing MoM' if (row['orders_mom_growth'] > 0 and row['gmv_mom_growth'] > 0)
        else 'Low Priority',
    axis=1
)

promo_df

,REST_NAME,total_orders,total_menu_opens,total_gmv,conversion_rate,orders_mom_growth,gmv_mom_growth,promo_priority
0,Brand A,6162,29124,2.345466e+06,0.211578,0.116613,0.188048,Growing MoM
1,Brand B,5647,33272,1.958607e+06,0.169722,-0.131105,-0.126201,Low Priority
2,Brand C,693,6183,3.952798e+05,0.112082,-0.248148,-0.260188,Low Priority
3,Brand D,1330,10717,7.475162e+05,0.124102,0.312821,0.304158,Growing MoM
4,Brand E,366,8172,4.761992e+05,0.044787,-0.250000,-0.322846,Low Priority
5,Brand F,1646,10646,1.091042e+06,0.154612,0.161790,0.217234,Growing MoM
6,Brand G,4451,26009,1.835530e+06,0.171133,0.132063,0.202079,Growing MoM

In [47]:
##

In [46]:
df.to_csv("clean_case_study.csv", index=False)